- finding missing data
- fixing invalid values

In [2]:
import numpy as np
import pandas as pd

In [2]:
pd.isnull(np.nan)

True

In [3]:
pd.isnull(None)

True

In [5]:
pd.isna(np.nan)

True

In [6]:
pd.isna(None)

True

In [7]:
pd.notnull(None)

False

In [3]:
pd.notnull(np.nan)

False

In [4]:
pd.notnull(3)

True

In [7]:
pd.isnull(pd.Series([1, np.nan, 7]))

0    False
1     True
2    False
dtype: bool

In [8]:
pd.notnull(pd.Series([1, np.nan, 7]))

0     True
1    False
2     True
dtype: bool

In [10]:
pd.isnull(pd.DataFrame({
    'Column A': [1, np.nan, 7],
    'Column B': [np.nan, 2, 3],
    'Column C': [np.nan, 2, np.nan]
}))

   Column A  Column B  Column C
0     False      True      True
1      True     False     False
2     False     False      True

In [11]:
s = pd.Series([1, 2, 3, np.nan, np.nan, 4])

In [12]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [13]:
# count the number of null values
pd.notnull(s).sum()

4

In [14]:
# output all the values that are not null
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [15]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [16]:
s.notnull()

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [17]:
s[s.notnull()]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [18]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [19]:
# only output the index and values that are not null
s.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [20]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [37]:
df = pd.DataFrame({
    'Column A': [1, 7, np.nan, 5],
    'Column B': [np.nan, 2, 3, np.nan],
    'Column C': [np.nan, 2, np.nan, np.nan],
    'Column D': [5, 8, 34, 110]
})

In [38]:
df.isnull()

   Column A  Column B  Column C  Column D
0     False      True      True     False
1     False     False     False     False
2      True     False      True     False
3     False      True      True     False

In [39]:
df.notnull()

   Column A  Column B  Column C  Column D
0      True     False     False      True
1      True      True      True      True
2     False      True     False      True
3      True     False     False      True

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column A  3 non-null      float64
 1   Column B  2 non-null      float64
 2   Column C  1 non-null      float64
 3   Column D  4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 260.0 bytes

In [41]:
# get the number of rows and columns
df.shape

(4, 4)

In [42]:
df.isnull().sum()

Column A    1
Column B    2
Column C    3
Column D    0
dtype: int64

In [43]:
df.notnull().sum()

Column A    3
Column B    2
Column C    1
Column D    4
dtype: int64

In [44]:
df.dropna()

   Column A  Column B  Column C  Column D
1       7.0       2.0       2.0         8

In [45]:
df.dropna(axis=1)

   Column D
0         5
1         8
2        34
3       110

In [46]:
df.dropna(how='all') # only drop rows where all columns are null

   Column A  Column B  Column C  Column D
0       1.0       NaN       NaN         5
1       7.0       2.0       2.0         8
2       NaN       3.0       NaN        34
3       5.0       NaN       NaN       110

In [47]:
df.dropna(how='any') # drop rows where any column is null

   Column A  Column B  Column C  Column D
1       7.0       2.0       2.0         8

In [48]:
df.dropna(thresh=3) # drop rows that have less than 3 real values

   Column A  Column B  Column C  Column D
1       7.0       2.0       2.0         8

In [49]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [50]:
s.fillna(0) # fill null values with 0

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [52]:
s.fillna(s.mean()) #  fill null values with the mean

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

In [55]:
s.fillna(method='ffill') # fill null values with the next value

C:\Users\Thinzar Hnin Yu\AppData\Local\Temp\ipykernel_16496\1676624699.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.fillna(method='ffill') # fill null values with the next value

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [56]:
s.fillna(method='bfill') # fill null values with the previous value

C:\Users\Thinzar Hnin Yu\AppData\Local\Temp\ipykernel_16496\2912014235.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.fillna(method='bfill') # fill null values with the previous value

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

In [57]:
pd.Series([np.nan, 3, np.nan, np.nan]).fillna(method='ffill')

C:\Users\Thinzar Hnin Yu\AppData\Local\Temp\ipykernel_16496\3479547259.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  pd.Series([np.nan, 3, np.nan, np.nan]).fillna(method='ffill')

0    NaN
1    3.0
2    3.0
3    3.0
dtype: float64

In [60]:
pd.Series([1, np.nan, 3, np.nan, np.nan]).fillna(method='bfill')

C:\Users\Thinzar Hnin Yu\AppData\Local\Temp\ipykernel_16496\2629518188.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  pd.Series([1, np.nan, 3, np.nan, np.nan]).fillna(method='bfill')

0    1.0
1    3.0
2    3.0
3    NaN
4    NaN
dtype: float64

In [61]:
df

   Column A  Column B  Column C  Column D
0       1.0       NaN       NaN         5
1       7.0       2.0       2.0         8
2       NaN       3.0       NaN        34
3       5.0       NaN       NaN       110

In [62]:
df.fillna(method='ffill', axis=1) # fill null values with the next value
# axis = 0 --> columns
# axis = 1 --> rows

C:\Users\Thinzar Hnin Yu\AppData\Local\Temp\ipykernel_16496\143677274.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', axis=1) # fill null values with the next value

   Column A  Column B  Column C  Column D
0       1.0       1.0       1.0       5.0
1       7.0       2.0       2.0       8.0
2       NaN       3.0       3.0      34.0
3       5.0       5.0       5.0     110.0

In [63]:
s.dropna().count() # count the number of non-null values

4

In [64]:
missing_values = len(s.dropna()) != len(s) # check if there are any missing values
missing_values

True

In [66]:
missing_values = s.count() != len(s) # check if there are any missing values
missing_values

True

In [67]:
pd.Series([True, False, True]).all() # check if all values are True

False

In [68]:
pd.Series([True, False, True]).any() # check if any values are True

True

In [69]:
df2 = pd.DataFrame({
    'Sex': ['M', 'F', 'F', 'D', '?'],
    'Age': [29, 30, 24, 290, 25],
})

In [70]:
df2['Sex'].unique() # get the unique values

array(['M', 'F', 'D', '?'], dtype=object)

In [71]:
df2['Sex'].nunique() # get the number of unique values

4

In [72]:
df2['Sex'].value_counts() # get the count of each unique value

Sex
F    2
M    1
D    1
?    1
Name: count, dtype: int64

In [75]:
df2['Sex'].replace({'D': 'F', '?': 'M'}) # replace values

0    M
1    F
2    F
3    F
4    M
Name: Sex, dtype: object

In [76]:
df2.replace({
    'Sex': {
        'D': 'F',
        '?': 'M'
    },
    'Age': {
        290: 29
    }
})

  Sex  Age
0   M   29
1   F   30
2   F   24
3   F   29
4   M   25

In [77]:
df2[df2['Age'] > 100] # get rows where Age is greater than 100'

  Sex  Age
3   D  290

In [80]:
df2.loc[df2['Age'] > 100, 'Age'] = df2.loc[df2['Age'] > 100, 'Age'] / 10

In [82]:
df2

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D   29
4   ?   25

In [89]:
ambassadors = pd.Series([
    'France', 
    'UK',
    'UK',
    'Italy', 
    'Germany',
    'Germany',
    'Germany',
], index = [
    'Gerard Araud',
    'Kim Darroch',
    'Peter Wittig',
    'Armando Varricchio',
    'Peter Westmacott',
    'Peter Ammon',
    'Klaus Scharioth'
])

In [90]:
ambassadors

Gerard Araud           France
Kim Darroch                UK
Peter Wittig               UK
Armando Varricchio      Italy
Peter Westmacott      Germany
Peter Ammon           Germany
Klaus Scharioth       Germany
dtype: object

In [91]:
ambassadors.duplicated() # check for duplicates
# by default, it will consider the first one as not duplicate

Gerard Araud          False
Kim Darroch           False
Peter Wittig           True
Armando Varricchio    False
Peter Westmacott      False
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [93]:
ambassadors.duplicated(keep="last") # consider the last one as not duplicate

Gerard Araud          False
Kim Darroch            True
Peter Wittig          False
Armando Varricchio    False
Peter Westmacott       True
Peter Ammon            True
Klaus Scharioth       False
dtype: bool

In [94]:
ambassadors.duplicated(keep=False) # consider all duplicates

Gerard Araud          False
Kim Darroch            True
Peter Wittig           True
Armando Varricchio    False
Peter Westmacott       True
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [95]:
ambassadors.drop_duplicates() # drop duplicates

Gerard Araud           France
Kim Darroch                UK
Armando Varricchio      Italy
Peter Westmacott      Germany
dtype: object

In [97]:
ambassadors.drop_duplicates(keep='last') # drop duplicates

Gerard Araud           France
Peter Wittig               UK
Armando Varricchio      Italy
Klaus Scharioth       Germany
dtype: object

In [106]:
players = pd.DataFrame({
    'Name': [
        'France', 
        'UK',
        'UK',
        'Italy', 
        'Germany',
        'Germany',
        'Germany',
    ], 
    'Country' : [
        'Gerard Araud',
        'Kim Darroch',
        'Peter Wittig',
        'Armando Varricchio',
        'Peter Westmacott',
        'Peter Ammon',
        'Klaus Scharioth'
    ]
})

In [107]:
players.duplicated() # check for duplicates

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [108]:
players.duplicated(subset=['Name'])

0    False
1    False
2     True
3    False
4    False
5     True
6     True
dtype: bool

In [109]:
players.duplicated(subset=['Name'], keep="last")

0    False
1     True
2    False
3    False
4     True
5     True
6    False
dtype: bool

In [110]:
d = pd.DataFrame({
    'Data': [
        '1997_M_US _1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970?_M_   IT_1',
        '1985F_I T_2',
    ]
})

In [111]:
df

   Column A  Column B  Column C  Column D
0       1.0       NaN       NaN         5
1       7.0       2.0       2.0         8
2       NaN       3.0       NaN        34
3       5.0       NaN       NaN       110

In [114]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Data    5 non-null      object
dtypes: object(1)
memory usage: 172.0+ bytes

In [115]:
d['Data'].str.split('_')

0       [1997, M, US , 1]
1       [1990?, M, UK, 1]
2        [1992, F, US, 2]
3    [1970?, M,    IT, 1]
4         [1985F, I T, 2]
Name: Data, dtype: object

In [116]:
d['Data'].str.split('_', expand=True)
# we can use other regular expressions to split the data

       0    1      2     3
0   1997    M    US      1
1  1990?    M     UK     1
2   1992    F     US     2
3  1970?    M     IT     1
4  1985F  I T      2  None

In [117]:
d = d['Data'].str.split('_', expand=True)

In [118]:
d.columns = ['Year', 'Sex', 'Country', 'No Children']

In [119]:
d

    Year  Sex Country No Children
0   1997    M     US            1
1  1990?    M      UK           1
2   1992    F      US           2
3  1970?    M      IT           1
4  1985F  I T       2        None